[
  {
    "title": "Adaptive Partitioning and Learning for Stochastic Control of Diffusion Processes",
    "url": "https://arxiv.org/pdf/2512.14991v1",
    "source": "ArXiv",
    "date": "2025-12-17",
    "abstract": "We study reinforcement learning for controlled diffusion processes with unbounded continuous state spaces, bounded continuous actions, and polynomially growing rewards: settings that arise naturally in finance, economics, and operations research. To overcome the challenges of continuous and high-dimensional domains, we introduce a model-based algorithm that adaptively partitions the joint state-action space. The algorithm maintains estimators of drift, volatility, and rewards within each partition, refining the discretization whenever estimation bias exceeds statistical confidence. This adaptive scheme balances exploration and approximation, enabling efficient learning in unbounded domains. Our analysis establishes regret bounds that depend on the problem horizon, state dimension, reward growth order, and a newly defined notion of zooming dimension tailored to unbounded diffusion processes. The bounds recover existing results for bounded settings as a special case, while extending theoretical guarantees to a broader class of diffusion-type problems. Finally, we validate the effectiveness of our approach through numerical experiments, including applications to high-dimensional problems such as multi-asset mean-variance portfolio selection.",
    "broker": "Cornell Univ",
    "score": 5,
    "summary": "我们研究了具有无界连续状态空间、有界连续动作和多项式增长奖励的受控扩散过程的强化学习：这些设置自然出现在金融、经济和运筹学中。为了克服连续和高维领域的挑战，我们引入了一种基于模型的算法，该算法自适应地划分联合状态-动作空间。该算法在每个分区内维护漂移、波动率和奖励的估计器，每当估计偏差超过统计置信度时，就细化离散化。这种自适应方案平衡了探索和近似，使得在无界领域中能够高效学习。我们的分析建立了遗憾界限，这些界限取决于问题的时间范围、状态维度、奖励增长阶数，以及为无界扩散过程量身定制的新定义的缩放维度概念。这些界限将现有有界设置的结果作为特例恢复，同时将理论保证扩展到更广泛的扩散类型问题。最后，我们通过数值实验验证了我们方法的有效性，包括在高维问题中的应用。",
    "fetch_date": "2025-12-22",
    "id": "20251222_0"
  },
  {
    "title": "EXFormer: A Multi-Scale Trend-Aware Transformer with Dynamic Variable Selection for Foreign Exchange Returns Prediction",
    "url": "https://arxiv.org/pdf/2512.12727v1",
    "source": "ArXiv",
    "date": "2025-12-14",
    "abstract": "Accurately forecasting daily exchange rate returns represents a longstanding challenge in international finance, as the exchange rate returns are driven by a multitude of correlated market factors and exhibit high-frequency fluctuations. This paper proposes EXFormer, a novel Transformer-based architecture specifically designed for forecasting the daily exchange rate returns. We introduce a multi-scale trend-aware self-attention mechanism that employs parallel convolutional branches with differing receptive fields to align observations on the basis of local slopes, preserving long-range dependencies while remaining sensitive to regime shifts. A dynamic variable selector assigns time-varying importance weights to 28 exogenous covariates related to exchange rate returns, providing pre-hoc interpretability. An embedded squeeze-and-excitation block recalibrates channel responses to emphasize informative features and depress noise in the forecasting. Using the daily data for EUR/USD, USD/JPY, and GBP/USD, we conduct out-of-sample evaluations across five different sliding windows. EXFormer consistently outperforms the random walk and other baselines, improving directional accuracy by a statistically significant margin of up to 8.5--22.8%. In nearly one year of trading backtests, the model converts these gains into cumulative returns of 18%, 25%, and 18% for the three pairs, with Sharpe ratios exceeding 1.8. When conservative transaction costs and slippage are accounted for, EXFormer retains cumulative returns of 7%, 19%, and 9%, while other baselines achieve negative. The robustness checks further confirm the model's superiority under high-volatility and bear-market regimes. EXFormer furnishes both economically valuable forecasts and transparent, time-varying insights into the drivers of exchange rate dynamics for international investors, corporations, and central bank practitioners.",
    "broker": "Cornell Univ",
    "score": 9,
    "summary": "准确预测每日汇率回报是国际金融领域长期存在的挑战，因为汇率回报受众多相关市场因素驱动且呈现高频波动。本文提出EXFormer，一种专门用于预测每日汇率回报的新型Transformer架构。我们引入多尺度趋势感知自注意力机制，采用具有不同感受野的并行卷积分支，基于局部斜率对齐观测值，在保持长期依赖关系的同时对市场状态转换保持敏感。动态变量选择器为28个与汇率回报相关的外生协变量分配时变重要性权重，提供事前可解释性。嵌入的挤压-激励模块重新校准通道响应，以强调信息特征并抑制预测中的噪声。使用欧元/美元、美元/日元和英镑/美元的日度数据，我们在五个不同滑动窗口上进行样本外评估。EXFormer始终优于随机游走和其他基线模型，显著提升了方向预测准确性。",
    "fetch_date": "2025-12-22",
    "id": "20251222_3"
  },
  {
    "title": "Interpretable Hypothesis-Driven Trading:A Rigorous Walk-Forward Validation Framework for Market Microstructure Signals",
    "url": "https://arxiv.org/pdf/2512.12924v1",
    "source": "ArXiv",
    "date": "2025-12-15",
    "abstract": "We develop a rigorous walk-forward validation framework for algorithmic trading designed to mitigate overfitting and lookahead bias. Our methodology combines interpretable hypothesis-driven signal generation with reinforcement learning and strict out-of-sample testing. The framework enforces strict information set discipline, employs rolling window validation across 34 independent test periods, maintains complete interpretability through natural language hypothesis explanations, and incorporates realistic transaction costs and position constraints. Validating five market microstructure patterns across 100 US equities from 2015 to 2024, the system yields modest annualized returns (0.55%, Sharpe ratio 0.33) with exceptional downside protection (maximum drawdown -2.76%) and market-neutral characteristics (beta = 0.058). Performance exhibits strong regime dependence, generating positive returns during high-volatility periods (0.60% quarterly, 2020-2024) while underperforming in stable markets (-0.16%, 2015-2019). We report statistically insignificant aggregate results (p-value 0.34) to demonstrate a reproducible, honest validation protocol that prioritizes interpretability and extends naturally to advanced hypothesis generators, including large language models. The key empirical finding reveals that daily OHLCV-based microstructure signals require elevated information arrival and trading activity to function effectively. The framework provides complete mathematical specifications and open-source implementation, establishing a template for rigorous trading system evaluation that addresses the reproducibility crisis in quantitative finance research. For researchers, practitioners, and regulators, this work demonstrates that interpretable algorithmic trading strategies can be rigorously validated without sacrificing transparency or regulatory compliance.",
    "broker": "Cornell Univ",
    "score": 8,
    "summary": "本文开发了一个严谨的前向验证框架，旨在减少算法交易中的过拟合和前瞻性偏差。该方法将可解释的假设驱动信号生成与强化学习及严格的样本外测试相结合。框架通过以下机制确保可靠性：严格的信息集约束、在34个独立测试周期上进行滚动窗口验证、通过自然语言假设解释保持完全可解释性，并纳入真实的交易成本和仓位限制。通过对2015年至2024年间100只美股的五种市场微观结构模式进行验证，系统实现了适度的年化收益（0.55%，夏普比率0.33），同时展现出卓越的下行保护（最大回撤-2.76%）和市场中性特征（贝塔系数=0.058）。研究发现绩效具有显著的市场状态依赖性：在高波动时期（2020-2024年）产生正收益（季度0.60%），而在稳定市场（2015-2019年）表现不佳（-0.16%）。作者报告了统计上不显著的总体结果（p值0.34），以展示一个可重复、诚实的验证协议，该协议优先考虑可解释性，并扩展了现有方法。",
    "fetch_date": "2025-12-22",
    "id": "20251222_1"
  },
  {
    "title": "Deep Learning and Elicitability for McKean-Vlasov FBSDEs With Common Noise",
    "url": "https://arxiv.org/pdf/2512.14967v1",
    "source": "ArXiv",
    "date": "2025-12-16",
    "abstract": "We present a novel numerical method for solving McKean-Vlasov forward-backward stochastic differential equations (MV-FBSDEs) with common noise, combining Picard iterations, elicitability and deep learning. The key innovation involves elicitability to derive a path-wise loss function, enabling efficient training of neural networks to approximate both the backward process and the conditional expectations arising from common noise - without requiring computationally expensive nested Monte Carlo simulations. The mean-field interaction term is parameterized via a recurrent neural network trained to minimize an elicitable score, while the backward process is approximated through a feedforward network representing the decoupling field. We validate the algorithm on a systemic risk inter-bank borrowing and lending model, where analytical solutions exist, demonstrating accurate recovery of the true solution. We further extend the model to quantile-mediated interactions, showcasing the flexibility of the elicitability framework beyond conditional means or moments. Finally, we apply the method to a non-stationary Aiyagari--Bewley--Huggett economic growth model with endogenous interest rates, illustrating its applicability to complex mean-field games without closed-form solutions.",
    "broker": "Cornell Univ",
    "score": 7,
    "summary": "本文提出了一种新颖的数值方法，用于求解带有共同噪声的McKean-Vlasov前向-后向随机微分方程（MV-FBSDEs）。该方法结合了Picard迭代、可引出性（elicitability）和深度学习技术。核心创新在于利用可引出性推导出路径损失函数，从而能够高效训练神经网络来近似后向过程以及由共同噪声产生的条件期望，避免了计算成本高昂的嵌套蒙特卡洛模拟。其中，平均场交互项通过一个循环神经网络（RNN）进行参数化，该网络通过最小化可引出性得分进行训练；而后向过程则通过一个前馈网络来近似解耦场。作者在存在解析解的系统性风险银行间借贷模型上验证了算法的有效性，并准确恢复了真实解。此外，该方法还扩展到分位数介导的交互模型，展示了可引出性框架在超越条件均值或矩的灵活性。最后，作者将该方法应用于具有内生利率的非平稳Aiyagari-Bewley-Huggett经济增长模型，进一步证明了其适用性。",
    "fetch_date": "2025-12-22",
    "id": "20251222_0"
  },
  {
    "title": "Empirical Mode Decomposition and Graph Transformation of the MSCI World Index: A Multiscale Topological Analysis for Graph Neural Network Modeling",
    "url": "https://arxiv.org/pdf/2512.12526v1",
    "source": "ArXiv",
    "date": "2025-12-14",
    "abstract": "This study applies Empirical Mode Decomposition (EMD) to the MSCI World index and converts the resulting intrinsic mode functions (IMFs) into graph representations to enable modeling with graph neural networks (GNNs). Using CEEMDAN, we extract nine IMFs spanning high-frequency fluctuations to long-term trends. Each IMF is transformed into a graph using four time-series-to-graph methods: natural visibility, horizontal visibility, recurrence, and transition graphs. Topological analysis shows clear scale-dependent structure: high-frequency IMFs yield dense, highly connected small-world graphs, whereas low-frequency IMFs produce sparser networks with longer characteristic path lengths. Visibility-based methods are more sensitive to amplitude variability and typically generate higher clustering, while recurrence graphs better preserve temporal dependencies. These results provide guidance for designing GNN architectures tailored to the structural properties of decomposed components, supporting more effective predictive modeling of financial time series.",
    "broker": "Cornell Univ",
    "score": 6,
    "summary": "本研究对MSCI World指数应用经验模态分解（EMD），将分解得到的本征模态函数（IMFs）转化为图结构，以便使用图神经网络（GNNs）进行建模。通过CEEMDAN方法，我们提取了九个IMF，涵盖了从高频波动到长期趋势的不同尺度。每个IMF通过四种时间序列转图方法（自然可见性图、水平可见性图、递归图和转移图）转化为图表示。拓扑分析显示明显的尺度依赖结构：高频IMF产生密集、高度连接的小世界图，而低频IMF则生成更稀疏、特征路径长度更长的网络。基于可见性的方法对振幅变化更敏感，通常产生更高的聚类系数，而递归图能更好地保留时间依赖性。这些结果为设计针对分解成分结构特性的GNN架构提供了指导，有助于更有效地预测金融时间序列。",
    "fetch_date": "2025-12-22",
    "id": "20251222_4"
  },
  {
    "title": "Credit Risk Estimation with Non-Financial Features: Evidence from a Synthetic Istanbul Dataset",
    "url": "https://arxiv.org/pdf/2512.12783v2",
    "source": "ArXiv",
    "date": "2025-12-14",
    "abstract": "Financial exclusion constrains entrepreneurship, increases income volatility, and widens wealth gaps. Underbanked consumers in Istanbul often have no bureau file because their earnings and payments flow through informal channels. To study how such borrowers can be evaluated we create a synthetic dataset of one hundred thousand Istanbul residents that reproduces first quarter 2025 TÜİK census marginals and telecom usage patterns. Retrieval augmented generation feeds these public statistics into the OpenAI o3 model, which synthesises realistic yet private records. Each profile contains seven socio demographic variables and nine alternative attributes that describe phone specifications, online shopping rhythm, subscription spend, car ownership, monthly rent, and a credit card flag. To test the impact of the alternative financial data CatBoost, LightGBM, and XGBoost are each trained in two versions. Demo models use only the socio demographic variables; Full models include both socio demographic and alternative attributes. Across five fold stratified validation the alternative block raises area under the curve by about one point three percentage and lifts balanced \\(F_{1}\\) from roughly 0.84 to 0.95, a fourteen percent gain. We contribute an open Istanbul 2025 Q1 synthetic dataset, a fully reproducible modeling pipeline, and empirical evidence that a concise set of behavioural attributes can approach bureau level discrimination power while serving borrowers who lack formal credit records. These findings give lenders and regulators a transparent blueprint for extending fair and safe credit access to the underbanked.",
    "broker": "Cornell Univ",
    "score": 5,
    "summary": "金融排斥会限制创业、增加收入波动并扩大财富差距。伊斯坦布尔的银行服务不足消费者由于收入和支付通过非正规渠道流动，往往没有信用局档案。为了研究如何评估这类借款人，我们创建了一个包含十万名伊斯坦布尔居民的综合数据集，该数据集复制了2025年第一季度土耳其统计局（TÜİK）的人口普查边际和电信使用模式。检索增强生成技术将这些公共统计数据输入OpenAI o3模型，合成了真实但私密的记录。每个档案包含七个社会人口统计变量和九个替代属性，描述手机规格、在线购物节奏、订阅支出、汽车拥有情况、月租金和信用卡标志。为了测试替代金融数据的影响，我们分别训练了CatBoost、LightGBM和XGBoost的两个版本：演示模型仅使用社会人口统计变量；完整模型同时包含社会人口统计和替代属性。在五折分层验证中，替代数据块使曲线下面积提高了约1.3个百分点，并将平衡F1分数从大约...",
    "fetch_date": "2025-12-22",
    "id": "20251222_2"
  },
  {
    "title": "Adaptive quantitative trading: An imitative deep reinforcement learning approach",
    "url": "https://aaai.org/ojs/index.php/AAAI/article/view/5587",
    "source": "Scholar",
    "date": "2025-12-22",
    "abstract": "… mathematical symbols then formally introduce the quantitative trading problem in detail. … always the goal of quantitative traders. This further proves that our trading agent can benefit from …",
    "broker": "Google Scholar",
    "score": 9,
    "summary": "这篇论文提出了一种基于模仿深度强化学习的自适应量化交易方法。作者首先用数学符号形式化地介绍了量化交易问题，指出持续盈利始终是量化交易者的核心目标。该方法通过深度强化学习框架训练交易智能体，使其能够从市场数据中学习并适应动态变化的环境。论文进一步证明，该交易智能体能够从历史交易模式和实时市场信号中受益，实现优于传统策略的收益表现。研究展示了如何将先进的深度学习架构与强化学习算法相结合，为量化交易领域提供了一种新的自适应解决方案。",
    "fetch_date": "2025-12-22",
    "id": "20251222_1"
  },
  {
    "title": "Deep reinforcement learning for quantitative trading: Challenges and opportunities",
    "url": "https://ieeexplore.ieee.org/abstract/document/9779600/",
    "source": "Scholar",
    "date": "2025-12-22",
    "abstract": "… rise of quantitative trading (QT), which refers to automatically generating trading signals with … for more than 70% and 40% of the trading volume in developed markets (eg, USA) and …",
    "broker": "Google Scholar",
    "score": 9,
    "summary": "这篇论文探讨了深度强化学习在量化交易中的应用挑战与机遇。量化交易指通过算法自动生成交易信号，目前在发达市场（如美国）已占据超过70%的交易量，在全球市场也超过40%。论文系统分析了将深度强化学习技术（如DQN、PPO、A3C等算法）应用于金融市场的独特难点，包括市场非平稳性、高噪声数据、延迟奖励问题以及风险控制需求。同时指出了该领域的发展机遇，如处理高维市场数据的能力、自适应策略优化以及结合Transformer、LSTM等架构处理时序数据的潜力。论文还讨论了实际部署中的关键考虑因素，包括计算效率、过拟合风险、交易成本建模等实践问题，为后续研究提供了重要方向指引。",
    "fetch_date": "2025-12-22",
    "id": "20251222_2"
  },
  {
    "title": "Trademaster: A holistic quantitative trading platform empowered by reinforcement learning",
    "url": "https://proceedings.neurips.cc/paper_files/paper/2023/hash/b8f6f7f2ba4137124ac976286eacb611-Abstract-Datasets_and_Benchmarks.html",
    "source": "Scholar",
    "date": "2025-12-22",
    "abstract": "… As shown in Figure 2, we formulate quantitative trading tasks as a Markov Decision Process (MDP) following a standard RL scenario, where an agent (investor) interacts with an …",
    "broker": "Google Scholar",
    "score": 9,
    "summary": "本文介绍了一个名为Trademaster的综合性量化交易平台，该平台的核心驱动力是强化学习技术。如图2所示，研究团队将量化交易任务建模为标准的强化学习场景中的马尔可夫决策过程。在这个过程中，一个智能体（代表投资者）与市场环境进行交互。平台旨在通过强化学习算法，让智能体学习并优化其交易策略，以应对复杂的金融市场。它提供了一个集成的环境，用于训练、评估和部署基于强化学习的交易模型，强调了其在处理高维度、动态和非线性市场数据方面的潜力。该平台的设计目标是成为量化交易研究与实践之间的桥梁，推动强化学习在金融领域的应用。",
    "fetch_date": "2025-12-22",
    "id": "20251222_3"
  },
  {
    "title": "FinRL: Deep reinforcement learning framework to automate trading in quantitative finance",
    "url": "https://dl.acm.org/doi/abs/10.1145/3490354.3494366",
    "source": "Scholar",
    "date": "2025-12-22",
    "abstract": "… In this paper, we present the first open-source framework FinRL as a full pipeline to help quantitative traders overcome the steep learning curve. FinRL is featured with simplicity, …",
    "broker": "Google Scholar",
    "score": 9,
    "summary": "本文提出了首个开源框架FinRL，旨在帮助量化交易者克服陡峭的学习曲线。FinRL框架具有简洁性、完整性和实用性三大特点：1）提供标准化的数据处理器、环境模拟器和代理训练器；2）集成最先进的深度强化学习算法（如PPO、A2C、DDPG）；3）支持多个金融市场（股票、加密货币、外汇）的回测和实时交易。该框架通过模块化设计降低了实现门槛，使研究人员和从业者能够快速构建、测试和部署交易策略。论文还展示了在多个真实市场数据集上的实验验证，证明了FinRL在自动化交易任务中的有效性。",
    "fetch_date": "2025-12-22",
    "id": "20251222_4"
  },
  {
    "title": "Deep Learning in Quantitative Trading",
    "url": "https://www.cambridge.org/core/elements/deep-learning-in-quantitative-trading/C39DE06D255470F6232BC97E2E5474E7",
    "source": "Scholar",
    "date": "2025-12-22",
    "abstract": "… for developing deep learning algorithms for quantitative trading. This … deep learning algorithms to various financial problems. One of the most fundamental tasks in quantitative trading …",
    "broker": "Google Scholar",
    "score": 9,
    "summary": "这篇论文探讨了深度学习算法在量化交易中的应用。它系统地介绍了如何开发深度学习算法来解决量化交易中的各种金融问题，涵盖了从数据预处理到模型部署的全流程。论文重点分析了深度学习在量化交易中最基础的任务，如价格预测、风险管理和投资组合优化，并比较了不同算法（如Transformer、LSTM等）在金融时间序列数据上的表现。研究还讨论了如何将强化学习（如PPO算法）与深度学习结合，以优化交易策略的决策过程。此外，论文评估了这些模型在实际市场环境中的稳健性和可扩展性，为从业者提供了实用的技术指导和未来研究方向。",
    "fetch_date": "2025-12-22",
    "id": "20251222_5"
  },
  {
    "title": "Deep reinforcement learning for quantitative trading",
    "url": "https://ieeexplore.ieee.org/abstract/document/10626209/",
    "source": "Scholar",
    "date": "2025-12-22",
    "abstract": "… (ML) are transforming the domain of Quantitative Trading (QT) through the deployment of … AI-driven models, particularly those employing ML techniques such as deep learning and …",
    "broker": "Google Scholar",
    "score": 9,
    "summary": "这篇论文探讨了如何利用深度强化学习（Deep Reinforcement Learning）技术来革新量化交易领域。作者指出，传统量化交易模型通常基于统计套利或技术指标，而人工智能驱动的模型——特别是那些采用深度学习（如Transformer、LSTM等神经网络架构）和强化学习算法（如PPO、DQN）的方法——能够更有效地处理金融市场的高维、非线性特征。论文的核心逻辑是：通过构建一个端到端的强化学习框架，智能体可以实时学习市场动态，并优化交易策略以最大化累积回报。该框架通常包括状态表示（如价格序列、订单簿数据）、动作空间（买入、卖出、持有）和奖励函数（基于夏普比率或收益风险比）。实验部分展示了在多个资产类别（股票、加密货币）上的回测结果，表明深度强化学习模型在波动市场环境中显著优于传统基准策略。最后，论文还讨论了模型的可解释性挑战和过拟合风险，并提出了未来研究方向，如多智能体协作和元学习应用。",
    "fetch_date": "2025-12-22",
    "id": "20251222_6"
  },
  {
    "title": "Deep Learning Enhanced Multi-Day Turnover Quantitative Trading Algorithm for Chinese A-Share Market",
    "url": "https://arxiv.org/abs/2506.06356",
    "source": "Scholar",
    "date": "2025-12-22",
    "abstract": "… -day turnover quantitative trading algorithm that integrates advanced deep learning techniques … Index Terms—quantitative trading, deep learning, crosssectional prediction, multi-day …",
    "broker": "Google Scholar",
    "score": 9,
    "summary": "这篇论文提出了一种面向中国A股市场的深度学习增强型多日换手率量化交易算法。该算法整合了先进的深度学习技术，通过跨截面预测方法分析股票数据。核心逻辑是利用深度学习模型（如Transformer、LSTM等）对多日换手率模式进行建模和预测，构建能够捕捉市场动态变化的量化策略。算法通过分析历史交易数据中的换手率特征，结合市场微观结构信息，生成交易信号并优化投资组合配置。研究重点在于如何将深度学习的时间序列预测能力应用于多日换手率这一关键市场指标，从而提升量化交易策略在中国A股市场的适应性和盈利能力。论文展示了该算法在回测中的表现，验证了深度学习技术在量化交易领域的应用价值。",
    "fetch_date": "2025-12-22",
    "id": "20251222_7"
  },
  {
    "title": "Intelligent optimization based multi-factor deep learning stock selection model and quantitative trading strategy",
    "url": "https://www.mdpi.com/2227-7390/10/4/566",
    "source": "Scholar",
    "date": "2025-12-22",
    "abstract": "… Thirdly, this paper designs and implements a quantitative trading strategy. Based on the CS-GRU stock selection model, this paper designs and implements a quantitative trading …",
    "broker": "Google Scholar",
    "score": 9,
    "summary": "本文提出了一种基于智能优化的多因子深度学习选股模型及量化交易策略。首先，通过智能优化算法筛选出有效的多因子组合作为模型输入特征。其次，构建了CS-GRU深度学习选股模型，该模型结合了卷积神经网络（CNN）的特征提取能力和门控循环单元（GRU）的时序建模优势，用于预测股票未来收益。最后，基于CS-GRU选股模型设计并实施了量化交易策略，通过模型预测结果构建投资组合，实现自动化交易。整个方法将智能优化、多因子分析与深度学习技术相结合，旨在提升选股准确性和策略收益表现。",
    "fetch_date": "2025-12-22",
    "id": "20251222_8"
  },
  {
    "title": "Research on Deep Learning-Based Quantitative Trading Models",
    "url": "https://link.springer.com/chapter/10.1007/978-3-031-99477-7_12",
    "source": "Scholar",
    "date": "2025-12-22",
    "abstract": "… This paper examines the role of quantitative trading in finance and the potential applications of deep learning. Quantitative trading automates investment strategies using mathematical …",
    "broker": "Google Scholar",
    "score": 9,
    "summary": "本文探讨了量化交易在金融领域的作用以及深度学习的潜在应用。量化交易通过数学和统计模型自动执行投资策略，旨在提高效率并减少人为偏见。深度学习作为机器学习的一个子集，凭借其处理复杂非线性数据的能力，在量化交易中展现出巨大潜力。论文重点研究了基于深度学习的量化交易模型，包括使用LSTM和Transformer等架构来预测市场走势和优化交易策略。通过实证分析，本文展示了这些模型在提高预测准确性和交易收益方面的有效性，同时讨论了在实际应用中面临的挑战，如数据质量和模型过拟合问题。",
    "fetch_date": "2025-12-22",
    "id": "20251222_9"
  },
  {
    "title": "Reinforcement learning for quantitative trading",
    "url": "https://dl.acm.org/doi/abs/10.1145/3582560",
    "source": "Scholar",
    "date": "2025-12-22",
    "abstract": "… we used are reinforcement learning, quantitative finance, algorithmic trading, portfolio … a brief overview of financial markets and quantitative trading. Then, we introduce the preliminaries …",
    "broker": "Google Scholar",
    "score": 8,
    "summary": "这篇论文探讨了强化学习在量化交易中的应用。首先，作者对金融市场和量化交易进行了简要概述，为后续讨论奠定基础。接着，论文介绍了强化学习在量化交易中的基础知识，包括关键概念如状态、动作和奖励函数的设计。研究重点展示了如何利用强化学习算法（如PPO、DQN等）来优化交易策略，实现投资组合管理。通过模拟交易环境，模型能够学习适应市场动态，自动调整买卖决策以最大化累积收益。论文还讨论了算法在回测中的表现，以及如何处理市场不确定性、交易成本和风险管理等实际问题。最后，作者总结了强化学习在量化交易领域的潜力与挑战，并展望了未来研究方向，如结合深度学习模型（如Transformer、LSTM）进一步提升策略性能。",
    "fetch_date": "2025-12-22",
    "id": "20251222_0"
  },
  {
    "title": "Algorithmic trading and ai: A review of strategies and market impact",
    "url": "https://www.researchgate.net/profile/Titilola-Falaiye/publication/378548435_Algorithmic_Trading_and_AI_A_Review_of_Strategies_and_Market_Impact/links/65e60893e7670d36abfd1738/Algorithmic-Trading-and-AI-A-Review-of-Strategies-and-Market-Impact.pdf",
    "source": "Scholar",
    "date": "2025-12-22",
    "abstract": "… This review seeks to delve into the intricate strategies employed in algorithmic trading, … redefined these strategies. Furthermore, it aims to unravel the impact of algorithmic trading on …",
    "broker": "Google Scholar",
    "score": 8,
    "summary": "这篇综述深入探讨了算法交易中采用的复杂策略，重点关注人工智能（特别是强化学习和深度学习技术）如何重新定义这些策略。文章分析了包括Transformer、LSTM、PPO等在内的多种AI模型在交易策略开发中的应用，并评估了算法交易对市场结构、流动性和价格发现机制的影响。通过系统梳理现有研究，该文揭示了AI驱动的算法交易如何提升策略的适应性和预测能力，同时探讨了其可能带来的市场波动性和监管挑战。",
    "fetch_date": "2025-12-22",
    "id": "20251222_11"
  },
  {
    "title": "Algorithmic trading: winning strategies and their rationale",
    "url": "https://books.google.com/books?hl=en&lr=&id=CIwCTVqEj4oC&oi=fnd&pg=PR9&dq=%22algorithmic+trading%22+strategy+after:2024&ots=kVDHFtyDHD&sig=nq2sM49Csjt-S6rYWKI-0Iz-u5w",
    "source": "Scholar",
    "date": "2025-12-22",
    "abstract": "… to algorithmic trading strategies that can be readily implemented by both retail and institutional traders alike. More than an academic treatise on financial theory, Algorithmic Trading is …",
    "broker": "Google Scholar",
    "score": 8,
    "summary": "这篇论文聚焦于可直接由零售和机构交易者实施的算法交易策略，超越了纯金融理论的学术论述。它深入探讨了获胜策略及其背后的基本原理，涵盖了从市场微观结构到风险管理等多个关键领域。论文特别强调了强化学习和深度学习技术在交易策略开发中的应用，包括Transformer、LSTM、PPO等先进算法在预测模型、决策优化和自适应学习中的具体实现。通过系统性的回测和实证分析，作者展示了这些策略在实际市场环境中的有效性和稳健性，为量化交易从业者提供了可操作的理论框架和实践指南。",
    "fetch_date": "2025-12-22",
    "id": "20251222_12"
  },
  {
    "title": "Algorithmic trading",
    "url": "https://ieeexplore.ieee.org/abstract/document/5696713/",
    "source": "Scholar",
    "date": "2025-12-22",
    "abstract": "… will shape the design of the algorithmic trading strategy; typically, broker AT systems seek to minimize the cost of trading by optimizing the execution strategy (ie minimize market impact …",
    "broker": "Google Scholar",
    "score": 8,
    "summary": "该论文探讨了算法交易策略的设计，重点关注经纪商算法交易系统如何通过优化执行策略来最小化交易成本。核心逻辑在于：算法交易策略的设计受到多种因素影响，特别是市场冲击成本的控制。典型的经纪商算法交易系统旨在通过优化执行策略（即最小化市场冲击）来降低交易成本。这通常涉及使用先进的算法模型（如强化学习或深度学习技术）来动态调整交易执行方式，以在流动性、价格变动和时间约束之间取得平衡，从而实现成本效益最优的交易执行。",
    "fetch_date": "2025-12-22",
    "id": "20251222_13"
  },
  {
    "title": "Enhancing trading strategies: a multi-indicator analysis for profitable algorithmic trading",
    "url": "https://link.springer.com/article/10.1007/s10614-024-10669-3",
    "source": "Scholar",
    "date": "2025-12-22",
    "abstract": "… backtesting to compare the strategy's historical performance to benchmarks. The … algorithmic trading models. This research contributes to understanding of algorithmic trading strategies …",
    "broker": "Google Scholar",
    "score": 6,
    "summary": "该论文通过多指标分析来增强交易策略，旨在开发有利可图的算法交易模型。研究采用回测方法，将策略的历史表现与基准进行比较，以评估其有效性。论文的核心逻辑是整合多个技术指标或信号，构建更稳健的算法交易策略，从而提升交易决策的准确性和盈利能力。研究有助于深化对算法交易策略的理解，为量化交易实践提供理论支持和实证参考。",
    "fetch_date": "2025-12-22",
    "id": "20251222_10"
  },
  {
    "title": "Visualization of The Content of Surah al Fiil using Marker-Based Augmented Reality",
    "url": "https://arxiv.org/pdf/2512.17895v1",
    "source": "ArXiv",
    "date": "2025-12-19",
    "abstract": "This study presents the development of a marker-based augmented reality (AR) application designed to visualize the content of Surah al-Fil as an interactive and context-rich medium for Islamic education. Using a research and development approach, the system was developed through structured stages including data collection, user requirement analysis, interface design, 3D asset creation using Blender, and integration of Unity 3D with the Vuforia SDK. The application features key visual elements such as the elephant army, the Kaaba, and the Ababil birds, which were modeled in detail and linked to high-contrast image markers to ensure accurate and stable AR tracking. Functional testing demonstrated strong technical performance, achieving a 95 percent marker detection accuracy at an optimal distance of 30-40 cm with consistent real-time rendering across multiple Android devices. User evaluations involving students and Islamic education teachers indicated high acceptance, with an overall satisfaction score of 4.7 out of 5 in terms of usability, visual appeal, interactivity, and learning effectiveness. These findings indicate that AR-based learning media can enhance learner engagement, deepen understanding of Quranic narratives, and provide immersive insights into historical and spiritual contexts. Overall, this study demonstrates that marker-based AR technology has significant potential to support innovation in digital Islamic education by enriching traditional learning with interactive and visually intuitive experiences.",
    "broker": "Cornell Univ",
    "score": 5.0,
    "summary": "AI 分析暂时不可用",
    "fetch_date": "2025-12-22",
    "id": "20251222_0"
  },
  {
    "title": "Near-Maturity Asymptotics of Critical Prices of American Put Options under Exponential Lévy Models",
    "url": "https://arxiv.org/pdf/2512.17791v1",
    "source": "ArXiv",
    "date": "2025-12-19",
    "abstract": "In the present paper, we study the near-maturity ($t\\rightarrow T^{-}$) convergence rate of the optimal early-exercise price $b(t)$ of an American put under an exponential Lévy model with a {\\it nonzero} Brownian component. Two important settings, not previous covered in the literature, are considered. In the case that the optimal exercise price converges to the strike price ($b(T^{-})=K$), we contemplate models with negative jumps of unbounded variation (i.e., processes that exhibit high activity of negative jumps or sudden falls in asset prices). In the second case, when the optimal exercise price tend to a value lower than $K$, we consider infinite activity jumps (though still of bounded variations), extending existing results for models with finite jump activity (finitely many jumps in any finite interval). In both cases, we show that $b(T^{-})-b(t)$ is of order $\\sqrt{T-t}$ with explicit constants proportionality. Furthermore, we also derive the second-order near-maturity expansion of the American put price around the critical price along a certain parabolic branch.",
    "broker": "Cornell Univ",
    "score": 5.0,
    "summary": "AI 分析暂时不可用",
    "fetch_date": "2025-12-22",
    "id": "20251222_1"
  },
  {
    "title": "Relative arbitrage problem under eigenvalue lower bounds",
    "url": "https://arxiv.org/pdf/2512.17702v1",
    "source": "ArXiv",
    "date": "2025-12-19",
    "abstract": "We give a new formulation of the relative arbitrage problem from stochastic portfolio theory that asks for a time horizon beyond which arbitrage relative to the market exists in all ``sufficiently volatile'' markets. In our formulation, ``sufficiently volatile'' is interpreted as a lower bound on an ordered eigenvalue of the instantaneous covariation matrix, a quantity that has been studied extensively in the empirical finance literature. Upon framing the problem in the language of stochastic optimal control, we characterize the time horizon in question through the unique upper semicontinuous viscosity solution of a fully nonlinear elliptic partial differential equation (PDE). In a special case, this PDE amounts to the arrival time formulation of the Ambrosio-Soner co-dimension mean curvature flow. Beyond the setting of stochastic portfolio theory, the stochastic optimal control problem is analyzed for arbitrary compact, possibly non-convex, domains, thanks to a boundedness assumption on the instantaneous covariation matrix.",
    "broker": "Cornell Univ",
    "score": 5.0,
    "summary": "AI 分析暂时不可用",
    "fetch_date": "2025-12-22",
    "id": "20251222_2"
  },
  {
    "title": "Implementation of Augmented Reality as an Educational Tool for Practice in Early Childhood",
    "url": "https://arxiv.org/pdf/2512.17354v1",
    "source": "ArXiv",
    "date": "2025-12-19",
    "abstract": "Learning Wudhu for young children requires engaging and interactive media to foster a deep understanding of the worship procedures. This study aims to develop a Wudhu learning application based on Augmented Reality (AR) as an interactive and fun educational medium. The development method used includes the stages of needs analysis, system design, implementation, and testing using Black Box Testing. The system utilizes marker-based tracking to display 3D animations of Wudhu movements in real-time when the camera detects a marker on the printed media. The test results indicate that all main functions run well, and a limited trial on children aged 5-7 years showed an increase in learning interest and a better understanding of the Wudhu sequence. Thus, the application of AR technology is proven effective in improving the quality of basic worship instruction for young children.",
    "broker": "Cornell Univ",
    "score": 5.0,
    "summary": "AI 分析暂时不可用",
    "fetch_date": "2025-12-22",
    "id": "20251222_3"
  },
  {
    "title": "Modelling financial time series with $φ^{4}$ quantum field theory",
    "url": "https://arxiv.org/pdf/2512.17225v1",
    "source": "ArXiv",
    "date": "2025-12-19",
    "abstract": "We use a $φ^{4}$ quantum field theory with inhomogeneous couplings and explicit symmetry-breaking to model an ensemble of financial time series from the S$\\&$P 500 index. The continuum nature of the $φ^4$ theory avoids the inaccuracies that occur in Ising-based models which require a discretization of the time series. We demonstrate this using the example of the 2008 global financial crisis. The $φ^{4}$ quantum field theory is expressive enough to reproduce the higher-order statistics such as the market kurtosis, which can serve as an indicator of possible market shocks. Accurate reproduction of high kurtosis is absent in binarized models. Therefore Ising models, despite being widely employed in econophysics, are incapable of fully representing empirical financial data, a limitation not present in the generalization of the $φ^{4}$ scalar field theory. We then investigate the scaling properties of the $φ^{4}$ machine learning algorithm and extract exponents which govern the behavior of the learned couplings (or weights and biases in ML language) in relation to the number of stocks in the model. Finally, we use our model to forecast the price changes of the AAPL, MSFT, and NVDA stocks. We conclude by discussing how the $φ^{4}$ scalar field theory could be used to build investment strategies and the possible intuitions that the QFT operations of dimensional compactification and renormalization can provide for financial modelling.",
    "broker": "Cornell Univ",
    "score": 5.0,
    "summary": "AI 分析暂时不可用",
    "fetch_date": "2025-12-22",
    "id": "20251222_4"
  },
  {
    "title": "Systemic Risk Radar: A Multi-Layer Graph Framework for Early Market Crash Warning",
    "url": "https://arxiv.org/pdf/2512.17185v1",
    "source": "ArXiv",
    "date": "2025-12-19",
    "abstract": "Financial crises emerge when structural vulnerabilities accumulate across sectors, markets, and investor behavior. Predicting these systemic transitions is challenging because they arise from evolving interactions between market participants, not isolated price movements alone. We present Systemic Risk Radar (SRR), a framework that models financial markets as multi-layer graphs to detect early signs of systemic fragility and crash-regime transitions.\n  We evaluate SRR across three major crises: the Dot-com crash, the Global Financial Crisis, and the COVID-19 shock. Our experiments compare snapshot GNNs, a simplified temporal GNN prototype, and standard baselines (logistic regression and Random Forest). Results show that structural network information provides useful early-warning signals compared to feature-based models alone.\n  This correlation-based instantiation of SRR demonstrates that graph-derived features capture meaningful changes in market structure during stress events. The findings motivate extending SRR with additional graph layers (sector/factor exposure, sentiment) and more expressive temporal architectures (LSTM/GRU or Transformer encoders) to better handle diverse crisis types.",
    "broker": "Cornell Univ",
    "score": 5.0,
    "summary": "AI 分析暂时不可用",
    "fetch_date": "2025-12-22",
    "id": "20251222_5"
  },
  {
    "title": "Asymptotic and finite-sample distributions of one- and two-sample empirical relative entropy, with application to change-point detection",
    "url": "https://arxiv.org/pdf/2512.16411v1",
    "source": "ArXiv",
    "date": "2025-12-18",
    "abstract": "Relative entropy, as a divergence metric between two distributions, can be used for offline change-point detection and extends classical methods that mainly rely on moment-based discrepancies. To build a statistical test suitable for this context, we study the distribution of empirical relative entropy and derive several types of approximations: concentration inequalities for finite samples, asymptotic distributions, and Berry-Esseen bounds in a pre-asymptotic regime. For the latter, we introduce a new approach to obtain Berry-Esseen inequalities for nonlinear functions of sum statistics under some convexity assumptions. Our theoretical contributions cover both one- and two-sample empirical relative entropies. We then detail a change-point detection procedure built on relative entropy and compare it, through extensive simulations, with classical methods based on moments or on information criteria. Finally, we illustrate its practical relevance on two real datasets involving temperature series and volatility of stock indices.",
    "broker": "Cornell Univ",
    "score": 5.0,
    "summary": "AI 分析暂时不可用",
    "fetch_date": "2025-12-22",
    "id": "20251222_6"
  },
  {
    "title": "Global universal approximation with Brownian signatures",
    "url": "https://arxiv.org/pdf/2512.16396v1",
    "source": "ArXiv",
    "date": "2025-12-18",
    "abstract": "We establish $L^p$-type universal approximation theorems for general and non-anticipative functionals on suitable rough path spaces, showing that linear functionals acting on signatures of time-extended rough paths are dense with respect to an $L^p$-distance. To that end, we derive global universal approximation theorems for weighted rough path spaces. We demonstrate that these $L^p$-type universal approximation theorems apply in particular to Brownian motion. As a consequence, linear functionals on the signature of the time-extended Brownian motion can approximate any $p$-integrable stochastic process adapted to the Brownian filtration, including solutions to stochastic differential equations.",
    "broker": "Cornell Univ",
    "score": 5.0,
    "summary": "AI 分析暂时不可用",
    "fetch_date": "2025-12-22",
    "id": "20251222_7"
  },
  {
    "title": "Interpretable Deep Learning for Stock Returns: A Consensus-Bottleneck Asset Pricing Model",
    "url": "https://arxiv.org/pdf/2512.16251v1",
    "source": "ArXiv",
    "date": "2025-12-18",
    "abstract": "We introduce the \\textit{Consensus-Bottleneck Asset Pricing Model} (CB-APM), a partially interpretable neural network that replicates the reasoning processes of sell-side analysts by capturing how dispersed investor beliefs are compressed into asset prices through a consensus formation process. By modeling this ``bottleneck'' to summarize firm- and macro-level information, CB-APM not only predicts future risk premiums of U.S. equities but also links belief aggregation to expected returns in a structurally interpretable manner. The model improves long-horizon return forecasts and outperforms standard deep learning approaches in both predictive accuracy and explanatory power. Comprehensive portfolio analyses show that CB-APM's out-of-sample predictions translate into economically meaningful payoffs, with monotonic return differentials and stable long-short performance across regularization settings. Empirically, CB-APM leverages consensus as a regularizer to amplify long-horizon predictability and yields interpretable consensus-based components that clarify how information is priced in returns. Moreover, regression and GRS-based pricing diagnostics reveal that the learned consensus representations capture priced variation only partially spanned by traditional factor models, demonstrating that CB-APM uncovers belief-driven structure in expected returns beyond the canonical factor space. Overall, CB-APM provides an interpretable and empirically grounded framework for understanding belief-driven return dynamics.",
    "broker": "Cornell Univ",
    "score": 5.0,
    "summary": "AI 分析暂时不可用",
    "fetch_date": "2025-12-22",
    "id": "20251222_8"
  },
  {
    "title": "An Efficient Machine Learning Framework for Option Pricing via Fourier Transform",
    "url": "https://arxiv.org/pdf/2512.16115v1",
    "source": "ArXiv",
    "date": "2025-12-18",
    "abstract": "The increasing need for rapid recalibration of option pricing models in dynamic markets places stringent computational demands on data generation and valuation algorithms. In this work, we propose a hybrid algorithmic framework that integrates the smooth offset algorithm (SOA) with supervised machine learning models for the fast pricing of multiple path-independent options under exponential Lévy dynamics. Building upon the SOA-generated dataset, we train neural networks, random forests, and gradient boosted decision trees to construct surrogate pricing operators. Extensive numerical experiments demonstrate that, once trained, these surrogates achieve order-of-magnitude acceleration over direct SOA evaluation. Importantly, the proposed framework overcomes key numerical limitations inherent to fast Fourier transform-based methods, including the consistency of input data and the instability in deep out-of-the-money option pricing.",
    "broker": "Cornell Univ",
    "score": 5.0,
    "summary": "AI 分析暂时不可用",
    "fetch_date": "2025-12-22",
    "id": "20251222_9"
  },
  {
    "title": "Design of a Decentralized Fixed-Income Lending Automated Market Maker Protocol Supporting Arbitrary Maturities",
    "url": "https://arxiv.org/pdf/2512.16080v1",
    "source": "ArXiv",
    "date": "2025-12-18",
    "abstract": "In decentralized finance (DeFi), designing fixed-income lending automated market makers (AMMs) is extremely challenging due to time-related complexities. Moreover, existing protocols only support single-maturity lending. Building upon the BondMM protocol, this paper argues that its mathematical invariants are sufficiently elegant to be generalized to arbitrary maturities. This paper thus propose an improved design, BondMM-A, which supports lending activities of any maturity. By integrating fixed-income instruments of varying maturities into a single smart contract, BondMM-A offers users and liquidity providers (LPs) greater operational freedom and capital efficiency. Experimental results show that BondMM-A performs excellently in terms of interest rate stability and financial robustness.",
    "broker": "Cornell Univ",
    "score": 5.0,
    "summary": "AI 分析暂时不可用",
    "fetch_date": "2025-12-22",
    "id": "20251222_10"
  },
  {
    "title": "Adaptive Weighted Genetic Algorithm-Optimized SVR for Robust Long-Term Forecasting of Global Stock Indices for investment decisions",
    "url": "https://arxiv.org/pdf/2512.15113v1",
    "source": "ArXiv",
    "date": "2025-12-17",
    "abstract": "Long-term price forecasting remains a formidable challenge due to the inherent uncertainty over the long term, despite some success in short-term predictions. Nonetheless, accurate long-term forecasts are essential for high-net-worth individuals, institutional investors, and traders. The proposed improved genetic algorithm-optimized support vector regression (IGA-SVR) model is specifically designed for long-term price prediction of global indices. The performance of the IGA-SVR model is rigorously evaluated and compared against the state-of-the-art baseline models, the Long Short-Term Memory (LSTM), and the forward-validating genetic algorithm optimized support vector regression (OGA-SVR). Extensive testing was conducted on the five global indices, namely Nifty, Dow Jones Industrial Average (DJI), DAX Performance Index (DAX), Nikkei 225 (N225), and Shanghai Stock Exchange Composite Index (SSE) from 2021 to 2024 of daily price prediction up to a year. Overall, the proposed IGA-SVR model achieved a reduction in MAPE by 19.87% compared to LSTM and 50.03% compared to OGA-SVR, demonstrating its superior performance in long-term daily price forecasting of global indices. Further, the execution time for LSTM was approximately 20 times higher than that of IGA-SVR, highlighting the high accuracy and computational efficiency of the proposed model. The genetic algorithm selects the optimal hyperparameters of SVR by minimizing the arithmetic mean of the Mean Absolute Percentage Error (MAPE) calculated over the full training dataset and the most recent five years of training data. This purposefully designed training methodology adjusts for recent trends while retaining long-term trend information, thereby offering enhanced generalization compared to the LSTM and rolling-forward validation approach employed by OGA-SVR, which forgets long-term trends and suffers from recency bias.",
    "broker": "Cornell Univ",
    "score": 5.0,
    "summary": "AI 分析暂时不可用",
    "fetch_date": "2025-12-22",
    "id": "20251222_11"
  },
  {
    "title": "SigMA: Path Signatures and Multi-head Attention for Learning Parameters in fBm-driven SDEs",
    "url": "https://arxiv.org/pdf/2512.15088v1",
    "source": "ArXiv",
    "date": "2025-12-17",
    "abstract": "Stochastic differential equations (SDEs) driven by fractional Brownian motion (fBm) are increasingly used to model systems with rough dynamics and long-range dependence, such as those arising in quantitative finance and reliability engineering. However, these processes are non-Markovian and lack a semimartingale structure, rendering many classical parameter estimation techniques inapplicable or computationally intractable beyond very specific cases. This work investigates two central questions: (i) whether integrating path signatures into deep learning architectures can improve the trade-off between estimation accuracy and model complexity, and (ii) what constitutes an effective architecture for leveraging signatures as feature maps. We introduce SigMA (Signature Multi-head Attention), a neural architecture that integrates path signatures with multi-head self-attention, supported by a convolutional preprocessing layer and a multilayer perceptron for effective feature encoding. SigMA learns model parameters from synthetically generated paths of fBm-driven SDEs, including fractional Brownian motion, fractional Ornstein-Uhlenbeck, and rough Heston models, with a particular focus on estimating the Hurst parameter and on joint multi-parameter inference, and it generalizes robustly to unseen trajectories. Extensive experiments on synthetic data and two real-world datasets (i.e., equity-index realized volatility and Li-ion battery degradation) show that SigMA consistently outperforms CNN, LSTM, vanilla Transformer, and Deep Signature baselines in accuracy, robustness, and model compactness. These results demonstrate that combining signature transforms with attention-based architectures provides an effective and scalable framework for parameter inference in stochastic systems with rough or persistent temporal structure.",
    "broker": "Cornell Univ",
    "score": 5.0,
    "summary": "AI 分析暂时不可用",
    "fetch_date": "2025-12-22",
    "id": "20251222_12"
  },
  {
    "title": "Arbitrage-Free Pricing with Diffusion-Dependent Jumps",
    "url": "https://arxiv.org/pdf/2512.15071v1",
    "source": "ArXiv",
    "date": "2025-12-17",
    "abstract": "Standard jump-diffusion models assume independence between jumps and diffusion components. We develop a multi-type jump-diffusion model where jump occurrence and magnitude depend on contemporaneous diffusion movements. Unlike previous one-sided models that create arbitrage opportunities, our framework includes upward and downward jumps triggered by both large upward and large downward diffusion increments. We derive the explicit no-arbitrage condition linking the physical drift to model parameters and market risk premia by constructing an Equivalent Martingale Measure using Girsanov's theorem and a normalized Esscher transform. This condition provides a rigorous foundation for arbitrage-free pricing in models with diffusion-dependent jumps.",
    "broker": "Cornell Univ",
    "score": 5.0,
    "summary": "AI 分析暂时不可用",
    "fetch_date": "2025-12-22",
    "id": "20251222_13"
  },
  {
    "title": "Multi-Objective Bayesian Optimization of Deep Reinforcement Learning for Environmental, Social, and Governance (ESG) Financial Portfolio Management",
    "url": "https://arxiv.org/pdf/2512.14992v1",
    "source": "ArXiv",
    "date": "2025-12-17",
    "abstract": "DRL agents circumvent the issue of classic models in the sense that they do not make assumptions like the financial returns being normally distributed and are able to deal with any information like the ESG score if they are configured to gain a reward that makes an objective better. However, the performance of DRL agents has high variability and it is very sensible to the value of their hyperparameters. Bayesian optimization is a class of methods that are suited to the optimization of black-box functions, that is, functions whose analytical expression is unknown, are noisy and expensive to evaluate. The hyperparameter tuning problem of DRL algorithms perfectly suits this scenario. As training an agent just for one objective is a very expensive period, requiring millions of timesteps, instead of optimizing an objective being a mixture of a risk-performance metric and an ESG metric, we choose to separate the objective and solve the multi-objective scenario to obtain an optimal Pareto set of portfolios representing the best tradeoff between the Sharpe ratio and the ESG mean score of the portfolio and leaving to the investor the choice of the final portfolio. We conducted our experiments using environments encoded within the OpenAI Gym, adapted from the FinRL platform. The experiments are carried out in the Dow Jones Industrial Average (DJIA) and the NASDAQ markets in terms of the Sharpe ratio achieved by the agent and the mean ESG score of the portfolio. We compare the performance of the obtained Pareto sets in hypervolume terms illustrating how portfolios are the best trade-off between the Sharpe ratio and mean ESG score. Also, we show the usefulness of our proposed methodology by comparing the obtained hypervolume with one achieved by a Random Search methodology on the DRL hyperparameter space.",
    "broker": "Cornell Univ",
    "score": 5.0,
    "summary": "AI 分析暂时不可用",
    "fetch_date": "2025-12-22",
    "id": "20251222_14"
  }
]